results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps10000-batch131072-acksall-prod12-complz4-trial3/producer-perf-6.log
producer_index=6
producer_count=12
producer_records=8333
producer_throughput=833
1 records sent, 0.1 records/sec (0.00 MB/sec), 16275.0 ms avg latency, 16275.0 ms max latency.
6712 records sent, 1318.1 records/sec (1.29 MB/sec), 4306.9 ms avg latency, 5869.0 ms max latency.
8333 records sent, 371.693653 records/sec (0.36 MB/sec), 4527.68 ms avg latency, 16275.00 ms max latency, 4575 ms 50th, 5963 ms 95th, 6102 ms 99th, 6141 ms 99.9th.